app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["post_id", 1], ["text", "Like this one"], ["created_at", "2022-10-29 08:34:39.128041"], ["updated_at", "2022-10-29 08:34:39.128041"]]
---
  def create
    @comment = Comment.new(text: params[:text], author_id: current_user.id, post_id: params[:post_id])
    @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 16]]
UPDATE "posts" SET "comments_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_count", 0], ["updated_at", "2022-11-02 14:36:26.776810"], ["id", 1]]
---
  def destroy
    @comment = Comment.find_by_id(params[:id])
    @comment.destroy
    @comment.update_post_comments_counter