app/controllers/likes_controller.rb

  def create
    @like = Like.new(author_id: current_user().id, post_id: params[:post_id])
    @like.save
---
INSERT INTO "likes" ("created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-10-28 23:12:19.917885"], ["updated_at", "2022-10-28 23:12:19.917885"], ["author_id", 1], ["post_id", 2]]