app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def index
    @posts = Post.all
    @user = User.find_by_id(params[:user_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (5) LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.find_by_id(params[:id])
    @posts = Post.all
    @users = User.all
    @user = User.find_by_id(params[:user_id])

INSERT INTO "posts" ("title", "text", "comments_count", "likes_count", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(title: params[:title], text: params[:text], author_id: current_user.id, likes_count: 0,
                     comments_count: 0)
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
UPDATE "users" SET "posts_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["posts_count", 5], ["updated_at", "2022-11-02 14:43:38.288890"], ["id", 1]]
---
  def destroy
    @post = Post.find_by_id(params[:id])
    @post.destroy
    @post.update_user_posts_counter