app/models/comment.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
UPDATE "posts" SET "comments_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_count", 0], ["updated_at", "2022-10-28 22:18:42.489847"], ["id", 2]]
---
  def update_post_comments_counter
    post = Post.find(post_id)
    post.update_attribute :comments_count, post.comments.count