app/models/like.rb

  def update_post_likes_counter
    post = Post.find(post_id)
    post.update(likes_count: post.likes.count)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]
UPDATE "posts" SET "likes_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_count", 1], ["updated_at", "2022-10-28 23:12:19.929270"], ["id", 2]]