app/models/post.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
UPDATE "users" SET "posts_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["posts_count", 8], ["updated_at", "2022-10-28 21:31:37.081634"], ["id", 1]]
---
  def update_user_posts_counter
    user = User.find(author_id)
    user.update(posts_count: user.posts.count)